[Akimbo X2SoldierClassTemplate]
+DisplayName="双枪手"
+ClassSummary="双枪手左右各拿一只单手枪械，在近中距离与敌人交战，擅长手枪战斗和躲闪，或用一连串的近战攻击让敌人难以招架。"
+LeftAbilityTreeTitle="枪斗士"
+RightAbilityTreeTitle="打击手"
AbilityTreeTitles[0]="枪斗士"
AbilityTreeTitles[1]="打击手"
AbilityTreeTitles[2]="替补者"


+RandomNickNames[0]="Judge"
+RandomNickNames[1]="Maverick"
+RandomNickNames[2]="Stuntmaster"
+RandomNickNames[3]="Trickster"
+RandomNickNames[4]="Ace"
+RandomNickNames[5]="Texas"
+RandomNickNames[6]="Fast"
+RandomNickNames[7]="Lucky"
+RandomNickNames[8]="Double"
+RandomNickNames[9]="Stand Off"
+RandomNickNames[10]="Cowboy"
+RandomNickNames[11]="Trigger"
+RandomNickNames[12]="Macedonian"
+RandomNickNames[13]="Wick"
+RandomNickNames[14]="Gunfall"
+RandomNickNames[15]="Gun Show"
+RandomNickNames[16]="Cleric"
+RandomNickNames[17]="Striker"
+RandomNickNames[18]="Reckless"
+RandomNickNames[19]="Magnus"
+RandomNickNames[20]="Rebel"
+RandomNickNames[21]="Sunder"
+RandomNickNames[22]="Impact"
+RandomNickNames[23]="Crow"

;+RandomNickNames[19]="Forty Seven"
;+RandomNickNames[11]="High Noon"
;+RandomNickNames[9]="Two Guns"
;+RandomNickNames[17]="Wild West"
;+RandomNickNames[14]="Bullet Wizard"
;+RandomNickNames[0]="Shooter"
;+RandomNickNames[2]="Six Gun"
;+RandomNickNames[3]="Ranger"
;+RandomNickNames[4]="Buffalo"
;+RandomNickNames[13]="Mason"
;+RandomNickNames[15]="Smith'n'Wesson"

;//SQUADDIE PERKS
;///LocHelpText - shown in tactical under ability name
;///LocLongDescription - shown in strategic at the bottom, and on mouseover on corner icon in tactical

[DP_DualPistols X2AbilityTemplate]
LocFriendlyName="双枪专精"
LocLongDescription="该士兵经过特殊训练，手持双枪没有命中惩罚。"
LocPromotionPopupText="<Bullet/>大多数双持攻击使用两支武器分别射击。每支枪的射击都单独计算命中数值，将受到该武器的升级插件影响。"

;//GUN FU PERKS

[DP_TrickShot X2AbilityTemplate]
LocFriendlyName="诱骗射击"
LocLongDescription="对掩体中的目标进行特殊的双枪射击。忽略掩体加成，并有+40%暴击率。两枪造成的伤害都来自主手武器。"
LocHelpText="用主手武器对掩体中的敌人进行侧翼射击。"
LocFlyOverText="诱骗射击" 
LocPromotionPopupText="<Bullet/> 需要双手枪。<br/><Bullet/> 只能攻击掩体中的敌人。 <br/><Bullet/> 忽略掩体的防御加成。<br/><Bullet/> 两枪造成的伤害都来自主手武器。 <br/><Bullet/> 该技能受益于猎人的本能，提供与侧翼射击相同的暴击率，但不会再得到其他的侧翼加成。<br/><Bullet/> 无冷却时间。"

[DP_BulletTime X2AbilityTemplate]
LocFriendlyName="子弹时间"
LocLongDescription="手枪射击、诱骗射击、断腿射击、乘乱必杀、倾泻弹药和多重火力，都不再结束回合。"
LocFlyOverText="子弹时间"
LocPromotionPopupText="<Bullet/> 通常双枪手不能得到“多重火力”，这是为了与Musashi's RPG Overhaul兼容。"

[DP_GunKata X2AbilityTemplate]
LocFriendlyName="枪斗术"
LocLongDescription="监视可以获得额外的监视行动点，可用于闪避敌人的攻击。"
LocHelpText="监视会额外增加一个监视行动点。可用于闪避敌人的攻击。"
LocFlyOverText="枪斗术" 
LocPromotionPopupText="<Bullet/> 监视期间，监视行动点可用于完全闪避敌人的攻击。 <Bullet/><br/> 如果攻击无论如何都不命中，则不消耗监视行动点。 <br/><Bullet/> 枪斗术效果适用于“守护”授予的监视行动点，包括威胁评估和其他类似技能。"

[DP_SpinningReload_Passive X2AbilityTemplate]
LocFriendlyName="旋转装弹"
LocLongDescription="重新装填武器将获得1个监视行动点。另外，该技能允许士兵在敌人回合时，使用监视行动点自动重新装弹。"
LocHelpText="自动重新装弹，费用为1个监视行动点。"
LocPromotionPopupText="<Bullet/> 在你的回合使用重新装填获得一个 \"免费\" 监视行动点。 <br/><Bullet/> 或者，如果士兵弹药用完，并且仍有至少1个监视行动点，则旋转装弹将在敌人回合时自动触发。 <br/><Bullet/> 如果在你下一回合开始时，士兵仍有至少1个监视行动点，他们将会重新装弹。即使士兵仍有一些弹药，也不会浪费监视行动点。 <br/><Bullet/> 如果监视状态下，重新装填武器需要超过1个行动点，将改为手枪监视。" 
LocFlyOverText="旋转装弹" 

[DP_SpinningReload_Reactive X2AbilityTemplate]
LocFriendlyName="旋转装弹"
LocLongDescription="重新装填你的武器，获得1个监视行动点。另外，该技能允许士兵在敌人回合时，使用监视行动点自动重新装弹。"
LocHelpText="自动重新装弹，费用为监视行动点。"
LocFlyOverText="旋转装弹" 

[DP_SpinningReload_EOT X2AbilityTemplate]
LocFriendlyName="旋转装弹"
LocLongDescription="重新装填你的武器，获得1个监视行动点。另外，该技能允许士兵在敌人回合时，使用监视行动点自动重新装弹。"
LocHelpText="自动重新装弹，费用为监视行动点。"
LocFlyOverText="旋转装弹" 

[DP_Quicksilver X2AbilityTemplate]
LocFriendlyName="快银之手"
LocLongDescription="监视不再结束回合。另外，反应射击有+20命中。"
LocHelpText="监视不再结束回合。另外，反应射击有+20命中。"
LocPromotionPopupText="<Bullet/> 该技能可以在每回合激活多次监视，每次激活都可以获得额外的监视行动点。 <br/><Bullet/> 技能本身的能力费用不受影响。例如，狙击步枪监视仍需要2个行动点才能激活。"
LocFlyOverText="快银之手" 

[DP_Unload X2AbilityTemplate]
LocFriendlyName="倾泻弹药"
LocLongDescription="每支武器向目标射击3次。有-20命中惩罚，不能暴击。消耗3弹药，3回合冷却。"
LocHelpText="每支武器向目标射击3次。3回合冷却。"
LocFlyOverText="倾泻弹药"

;//SCRAPPER PERKS

[DP_PistolWhip X2AbilityTemplate]
LocFriendlyName="枪柄打击"
LocLongDescription="移动到敌人附近，用两支武器近战攻击，造成标准射击伤害。"
LocHelpText="移动到敌人附近，用两支武器近战攻击。"
LocFlyOverText="枪柄打击"
LocPromotionPopupText="<Bullet/>枪柄打击造成普通武器伤害，但它不会获得侧翼的暴击加成或特殊弹药的加成效果。<br/><Bullet/>每支武器打击使用单独的命中计算。"

[DP_BonusMeleeAim X2AbilityTemplate]
LocFriendlyName="扳机护圈"
LocLongDescription="双持武器时，所有近战攻击获得被动+20命中加成。另外，如果敌人原本已在近战范围内，使用枪柄打击不再结束回合。"
LocHelpText="双持武器时，所有近战攻击获得被动+20命中加成。另外，如果敌人原本已在近战范围内，使用枪柄打击不再结束回合。"

[DP_TakeInitiative X2AbilityTemplate]
LocFriendlyName="近战反应"
LocLongDescription="用枪柄打击进攻敌人后，立即对近战范围内的每个敌人（包括原目标）触发额外的双重近战反应攻击。"
LocFlyOverText="近战反应"
LocPromotionPopupText="<Bullet/> 每个回合，对每个敌人都可以触发一次“近战反应”或“近战特权”的双重近战攻击。 <br/><Bullet/> 该能力的使用限制，在你或敌人的回合结束时重置。<br/><Bullet/> 这些攻击按“反应射击”来计算，将受到命中惩罚。"

[DP_CQCSupremacy X2AbilityTemplate]
LocFriendlyName="近战特权"
LocLongDescription="对在近战范围内移动或尝试行动的敌人，你可进行免费的双重近战攻击。"
LocFlyOverText="近战特权"
LocPromotionPopupText="<Bullet/> 每个回合，对每个敌人都可以触发一次“近战特权”或“近战反应”的双重近战攻击。 <br/><Bullet/> 该能力的使用限制，在你或敌人的回合结束时重置。"

[DP_ElectrifiedSpikes X2AbilityTemplate]
LocFriendlyName="带电尖刺"
LocLongDescription="对同一目标多次近战攻击有75%几率造成混乱，对混乱的敌人近战攻击有75%几率造成眩晕。另外，对混乱或眩晕的敌人进行攻击时，每次命中将撕碎1护甲。"
LocFlyOverText="带电尖刺"
LocPromotionPopupText="<Bullet/>该效果适用于枪柄打击的二次攻击。<br/><Bullet/>如果你在Musashi's RPG Overhaul中使用该技能，则要注意它只适用于双枪手的近战攻击。"

[DP_Checkmate X2AbilityTemplate]
LocFriendlyName="乘乱必杀"
LocLongDescription="特殊的主手攻击，对近距离内眩晕、混乱或恐慌的敌人，造成额外1倍伤害。如果使用双枪，则为3倍。一定命中并暴击。" 
LocHelpText="必命中、必暴击的主手攻击，对近距离内眩晕、混乱或恐慌的敌人，造成额外1倍伤害。如果使用双枪，则为3倍。"
LocFlyOverText="乘乱必杀"
LocPromotionPopupText="<Bullet/> 只能对1格内眩晕、混乱或恐慌的敌人使用。<br/><Bullet/> 不能移动后使用。<br/><Bullet/> 一定命中和暴击。<br/><Bullet/> 消耗1弹药。无冷却时间。"

[DP_LimitBreak X2AbilityTemplate]
LocFriendlyName="超限血战"
LocLongDescription="打破思维枷锁，完美控制身体。获得无限次的行动直到回合结束。第4次后的每次行动都会使自身受伤，等同最大生命值的10%。第5次后的每次行动会有越来越大的几率使自身失去意识。受到的所有他方伤害转到下一回合生效并放大25%。每个任务可使用1次。"
LocHelpText="获得无限次的行动直到回合结束。长时间使用会使自身受伤，并可能使自身失去意识。所有他方伤害延迟1回合并放大25%。"
LocFlyOverText="超限血战"
LocPromotionPopupText="<Bullet/>超限血战至少需要1行动点才能激活，还将使你失去所有剩余行动点。<br/><Bullet/>激活超限血战后，士兵在回合结束前将有无限次的行动。然而第4次后，士兵将立即受到等同最大生命值10%的伤害。<br/><Bullet/>这种自我伤害将取消监视状态。<br/><Bullet/>受到的所有他方伤害转到下一回合生效并放大25%。<br/><Bullet/>如果攻击造成的伤害超过士兵目前的生命值，仍将会死亡。<br/><Bullet/>连续5次以上的行动将有几率使士兵失去意识。失去意识的几率：<br/><Bullet/>6次行动： 25%<br/><Bullet/>7次行动：50%<br/><Bullet/>8次行动：75%<br/><Bullet/>9次行动：90%<br/><Bullet/>10次行动：95%<br/><Bullet/>注意：心灵护盾或其他类似效果将可预防士兵失去意识。<br/><Bullet/>如果士兵失去意识，但在同一回合苏醒，则会继续受到超限血战的影响，并且所使用的行动数量不会重置。"

[DP_LimitBreak_SelfDamage X2AbilityTemplate]
LocFlyOverText="超限血战"

;// SUPPLEMENTAL TREE

[DP_LegShot X2AbilityTemplate]
LocFriendlyName="断腿射击"
LocLongDescription="特殊的双枪射击，降低敌人的移动能力，并可能使其无法移动。造成武器的一半伤害，不能暴击。移动降低持续1回合。"
LocHelpText="双枪射击可使目标固定在原地1回合。造成武器的一半伤害，不能暴击。"
LocFlyOverText="断腿射击"
LocPromotionPopupText="<Bullet/> 需要双手枪。 <br/><Bullet/> 该技能的每次命中都会减少敌人的10点移动数值。它不会阻止敌人使用传送或爪钩。<br/><Bullet/> 无冷却时间。"

[DP_DirtyKick X2AbilityTemplate]
LocFriendlyName="卑鄙打击"
LocLongDescription="移动到敌人处，并踢到易受伤害的位置。如果命中，眩晕3个行动点。"
LocHelpText="移动到敌人处，并踢到易受伤害的位置。如果命中，眩晕3个行动点。"
LocFlyOverText="卑鄙打击"
LocPromotionPopupText="<Bullet/>该技能使用包括了移动和近战攻击，但不会造成伤害，即使拥有猎人本能。<br/><Bullet/>不能攻击大型敌人和机器敌人。<br/><Bullet/>如果命中，眩晕3个行动点。这意味着大多数敌人将在下一回合依然眩晕，这可能使他在下一回合只能用1个行动点。<br/><Bullet/>消耗1行动点，不结束回合。<br/><Bullet/> 3回合冷却。"

[DP_HuntersInstinct X2AbilityTemplate]
LocFriendlyName="猎人本能"
LocLongDescription="增加对侧翼敌人的远程伤害1。增加近战伤害1。"
LocFlyOverText="猎人本能"
LocPromotionPopupText="伤害奖励适用于每次射击和每次近战攻击。影响诱骗射击。"